In [1]:
import pandas as pd
import numpy as np

In [2]:
 data = pd.Series(np.random.randn(9),
                  index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])
# multiple indexing # a a a ki 1 2 3 index
# b b ki 1 3

In [3]:
data

a  1   -1.728657
   2   -0.628263
   3   -0.376113
b  1    0.241338
   3    0.169742
c  1    0.757484
   2    0.820105
d  2    0.548538
   3    0.994475
dtype: float64

In [4]:
data['a'][2]

-0.6282631527455996

In [ ]:
# sirf iloc mein index ka hoga baqii wesay index ka name daengay pandas mein

In [6]:
data.loc['a':'c':2]

a  1   -1.728657
   3   -0.376113
b  3    0.169742
c  2    0.820105
dtype: float64

In [7]:
data.loc[['a','b']]

a  1   -1.728657
   2   -0.628263
   3   -0.376113
b  1    0.241338
   3    0.169742
dtype: float64

In [9]:
data.loc[:,2]

a   -0.628263
c    0.820105
d    0.548538
dtype: float64

In [11]:
data.loc[:'b',3]

a  3   -0.376113
b  3    0.169742
dtype: float64

In [12]:
data.unstack() # 1st index ( a,b,c) ko rows aur second index(1,2,3) ko columns bana # dataframe mein karraha hae

          1         2         3
a -1.728657 -0.628263 -0.376113
b  0.241338       NaN  0.169742
c  0.757484  0.820105       NaN
d       NaN  0.548538  0.994475

In [13]:
data.unstack().stack() # phir say series + multiindexing

a  1   -1.728657
   2   -0.628263
   3   -0.376113
b  1    0.241338
   3    0.169742
c  1    0.757484
   2    0.820105
d  2    0.548538
   3    0.994475
dtype: float64

In [14]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=[['Pak', 'Pak', 'Ind'], ['KHI', 'lah', 'Banglore']])

In [15]:
frame

    Pak          Ind
    KHI lah Banglore
a 1   0   1        2
  2   3   4        5
b 1   6   7        8
  2   9  10       11

In [24]:
frame['Pak']['lah']

a  1     1
   2     4
b  1     7
   2    10
Name: lah, dtype: int32

In [27]:
frame['Pak']['lah']['b',2]

10

In [23]:
frame['Pak'].loc['b',2]

KHI     9
lah    10
Name: (b, 2), dtype: int32

In [32]:
frame['Pak'].iloc[2]

KHI    6
lah    7
Name: (b, 1), dtype: int32

In [33]:
frame['Pak'].iloc[3]

KHI     9
lah    10
Name: (b, 2), dtype: int32

In [36]:
frame.columns.names=['Country','City']

In [37]:
frame.index.names=['key1','key2']

In [38]:
frame

Country   Pak          Ind
City      KHI lah Banglore
key1 key2
a    1      0   1        2
     2      3   4        5
b    1      6   7        8
     2      9  10       11

In [1]:
import pandas as pd

In [40]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [46]:
d1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data': range(7)})
d1

  key  data
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   a     5
6   b     6

In [47]:
d2=pd.DataFrame({'key': ['a', 'b', 'd'],'data': range(3)})
d2

  key  data
0   a     0
1   b     1
2   d     2

In [41]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [48]:
pd.merge(d1,d2,on='key')

  key  data_x  data_y
0   b       0       1
1   b       1       1
2   b       6       1
3   a       2       0
4   a       4       0
5   a       5       0

In [49]:
pd.merge(d1,d2,on='key',suffixes=('_left','_right'))

  key  data_left  data_right
0   b          0           1
1   b          1           1
2   b          6           1
3   a          2           0
4   a          4           0
5   a          5           0

In [42]:
pd.merge(df1, df2) # c ka dosray data frame kay sath koi combination nhi ban raha tha tou left kardia ussay
    #aur d ka dosray data frame kay sath koi combination nhi ban raha tha,tou left kardia ussay

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [43]:
pd.merge(df1, df2,how='right') #--------

  key  data1  data2
0   b    0.0      1
1   b    1.0      1
2   b    6.0      1
3   a    2.0      0
4   a    4.0      0
5   a    5.0      0
6   d    NaN      2

In [45]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [13]:
df3 = pd.DataFrame({'name': ['a','b','c','e','b'],'place':['x','y','z','q','w'],'age': range(5) })
df3

  name place  age
0    a     x    0
1    b     y    1
2    c     z    2
3    e     q    3
4    b     w    4

In [19]:
df4 = pd.DataFrame({'name': ['a','b','c','d'],'place':['x','y','x','q'],'age1': range(1,5)})
df4

  name place  age1
0    a     x     1
1    b     y     2
2    c     x     3
3    d     q     4

In [20]:
pd.merge(df3, df4) # 2 columns same name kay thay tou unki values ko dekhtay way merge karaega

  name place  age  age1
0    a     x    0     1
1    b     y    1     2

In [25]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [26]:
 df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [27]:
pd.merge(df3, df4) # error no same common column available for merge

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [24]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey') # left walay dataframe say lkey aur right wlaya dataframe say rkey 
#kay hisaab say merging ki

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [28]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey',how='outer') # dono column ki values common hona yaa na hoon phir bhi 
# phir bhi dekhayga ,

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [29]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [30]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [31]:
df3.join(df4) # index kay hisaab say join karaengay

  lkey  data1 rkey  data2
0    b      0    a    0.0
1    b      1    b    1.0
2    a      2    d    2.0
3    c      3  NaN    NaN
4    a      4  NaN    NaN
5    a      5  NaN    NaN
6    b      6  NaN    NaN

In [35]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],index=['a', 'c', 'e'],columns=['Ohio', 'Nevada'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [36]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],index=['b', 'c', 'd', 'e'],columns=['Missouri', 'Alabama'])
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [34]:
left2.join(right2) # jo left2 kay index right2 mein common haen unko laega

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [37]:
right2.join(left2) #jo right2 kay index left2 mein common haen unko laega

   Missouri  Alabama  Ohio  Nevada
b       7.0      8.0   NaN     NaN
c       9.0     10.0   3.0     4.0
d      11.0     12.0   NaN     NaN
e      13.0     14.0   5.0     6.0

In [38]:
left2.join(right2,how='outer') # jo left2 kay index right2 mein common haen unko laega , aur jo right2 kay uncommon

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [ ]:
#rsuffix aur rsuffix ko dekhaaay ga

In [50]:
left2.join(right2,how='left')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [51]:
left2.join(right2,how='right') # jo left2 kay index right2 mein common haen unko laega , aur jo right2 kay uncommon

   Ohio  Nevada  Missouri  Alabama
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [53]:
import numpy as np

In [56]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['one', 'two'])

In [57]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [58]:
df2

   one  two
a    5    6
c    7    8

In [ ]:
# columns kay name same hoon gay tou kaam karagea

In [59]:
pd.concat([df1,df2])

   one  two
a    0    1
b    2    3
c    4    5
a    5    6
c    7    8